# 2.1) Working on CSV, Excel, txt, and JSON

In [2]:
# Some imports needed
import pandas as pd
from io import StringIO

### I) Reading CSV file (read_csv)

**Note:**
- We are not having CSV file so we will be using StringIO of io module.
- StringIO:
  - StringIO(data) creates an in-memory file-like object from the string data. It behaves like a file but exists only in memory, not on disk.
  - This is useful when we have data in string format and want to process it using functions that expect file-like input (e.g., pd.read_csv).

In [3]:
data = "Name;Age;City\nAlice;30;New York\nBob;25;Los Angeles"

# Reading the CSV
df = pd.read_csv(StringIO(data), sep=';')
print(df)

    Name  Age         City
0  Alice   30     New York
1    Bob   25  Los Angeles

#### Some parameters in read_csv()

**(i) sep:**
- The sep parameter tells pandas how the data in the file is separated.
- By default, a CSV (Comma-Separated Values) file uses commas , as the delimiter. However, in some files, different delimiters like semicolons ;, tabs \t, or pipes | are used.
- Why is it needed?
  - If the delimiter in the file is not a comma, we must specify it using sep so pandas knows how to split the data.

In [10]:
import pandas as pd
from io import StringIO

# Example data with a tab (\t) delimiter
data = "Name\tAge\tCity\nAlice\t30\tNew York\nBob\t25\tLos Angeles"

# Reading the CSV using a tab as the delimiter
df = pd.read_csv(StringIO(data), sep='\t')
print(df)

    Name  Age         City
0  Alice   30     New York
1    Bob   25  Los Angeles

**(ii) index_col (Index Column):**
- This parameter lets us specify which column to use as the row index.
- By default, pandas assigns a numeric index starting at 0. For instance, in above example we can see the default indexing in row.
- Why is it useful?
  - Sometimes, a specific column (e.g., ID or Date) is more meaningful as the row index.

In [12]:
data = "ID,Name,Age\n1,Alice,30\n2,Bob,25"

# Reading the CSV and setting 'ID' as the row index
df = pd.read_csv(StringIO(data), index_col='ID')
print(df)

     Name  Age
ID
1   Alice   30
2     Bob   25

**(iii) header (Header Row):**
- By default, pandas assumes the first row contains column names. We can use the header to specify which row to use as column names or to disable headers.
- Why is it useful?
  - If our file doesn't have column headers, set header=None.
  - To skip some initial rows and use another row as headers.

In [16]:
data = "Extra1,Extra2,Extra3\nName,Age,City\nAlice,30,New York\nBob,25,Los Angeles"

# Skip the first row and use the second row as the header
df = pd.read_csv(StringIO(data), header=1)  # Here, the first row (Extra1,Extra2,Extra3) is ignored.
df

    Name  Age         City
0  Alice   30     New York
1    Bob   25  Los Angeles

In [24]:
data = "Extra1,Extra2,Extra3\nName,Age,City\nAlice,30,New York\nBob,25,Los Angeles"

# Skip the first row and use the second row as the header
df = pd.read_csv(StringIO(data), header=None)  # Here, the first row (Extra1,Extra2,Extra3) will not be ignored.
df

        0       1            2
0  Extra1  Extra2       Extra3
1    Name     Age         City
2   Alice      30     New York
3     Bob      25  Los Angeles

**(iv) usecols (Select Columns):**
- This parameter lets us read specific columns from the CSV file.
- It’s particularly useful when dealing with large datasets where we only need a subset of the columns.

In [17]:
data = "Name,Age,City,Salary\nAlice,30,New York,50000\nBob,25,Los Angeles,45000"

# Reading only the 'Name' and 'City' columns
df = df = pd.read_csv(StringIO(data), usecols=['Name', 'City'])
df

    Name         City
0  Alice     New York
1    Bob  Los Angeles

**(v) skiprows (Skip Initial Rows):**
- This skips a specified number of rows from the beginning of the file.
- We can also pass a list of row indices to skip specific rows.

In [22]:
data = "Ignore1,Ignore2\nName,Age,City\nAlice,30,New York\nBob,25,Los Angeles"

# Skip the first row
df = pd.read_csv(StringIO(data), skiprows=1)
print(df)

    Name  Age         City
0  Alice   30     New York
1    Bob   25  Los Angeles

**(vi) nrows (Number of Rows):**
- Reads only the first n rows of the file. It’s helpful when previewing a large file.

In [25]:
data = "Name,Age,City\nAlice,30,New York\nBob,25,Los Angeles\nCharlie,35,Chicago"

# Read only the first 2 rows
df = pd.read_csv(StringIO(data), nrows=2)
df

    Name  Age         City
0  Alice   30     New York
1    Bob   25  Los Angeles

**(vii) encoding (Text Encoding):**
- The encoding parameter is used to specify the character encoding of the file. It’s necessary when the file contains special characters, such as accented letters or non-English text.
- Common encodings are:
  - utf-8 (default)
  - latin-1
  - cp1252
- Why is it useful?
  - Without specifying the correct encoding, we might encounter errors like UnicodeDecodeError.

In [27]:
# Example data saved in a file with special characters and Latin-1 encoding
data = "Name,City\nJosé,México\nZoë,België"

# Save it in a StringIO object with utf-8 encoding for demonstration
file = StringIO(data)

# Read the file with the correct encoding
df = pd.read_csv(file, encoding='utf-8') # Special characters like José and México are correctly read when the utf-8 encoding is specified.
df

   Name    City
0  José  México
1   Zoë  België

**(viii) on_bad_lines (Handling Bad Lines):**
- In some files, there may be rows with errors (e.g., missing values or extra columns). on_bad_lines helps handle such cases:
  - error: Raises an error.
  - warn: Logs a warning and skips the line.
  - skip: Simply skips bad lines without warnings.

In [28]:
data = "Name,Age,City\nAlice,30,New York\nBadLine\nBob,25,Los Angeles"

# If we do not use 'skip' to skip bad lines
df = pd.read_csv(StringIO(data))
df

      Name   Age         City
0    Alice  30.0     New York
1  BadLine   NaN          NaN
2      Bob  25.0  Los Angeles

In [31]:
data = "Name,Age,City\nAlice,30,New York\nBadLine\nBob,25,Los Angeles"

# Using 'skip' to skip bad lines
df = pd.read_csv(StringIO(data), on_bad_lines='skip')   # If there would be some bad line then it would be skipped
df

      Name   Age         City
0    Alice  30.0     New York
1  BadLine   NaN          NaN
2      Bob  25.0  Los Angeles

- Why BadLine is not skipped here?
  - Although it appears to be "bad," it has only one field, and pandas tries to parse it into the first column, leaving the remaining columns as NaN. Therefore, pandas does not consider it an unparsable line and does not skip it.

**(ix) dtype (Specifying Data Types):**
- This parameter lets us define the data type of each column. It is useful to ensure consistency, avoid unnecessary memory usage (for instance we may have column with int data but its type as float, hence leading to memory wastage), or fix type mismatches.

In [32]:
data = "Name,Age,Salary\nAlice,30,50000\nBob,25,45000"

# Reading the file and forcing 'Age' as a float
df = pd.read_csv(StringIO(data), dtype={'Age': 'float', 'Salary': 'int'})
print(df)
print(df.dtypes)

    Name   Age  Salary
0  Alice  30.0   50000
1    Bob  25.0   45000
Name       object
Age       float64
Salary      int64
dtype: object

**(x) parse_dates (Handling Dates):**
- This parameter converts columns containing date information into datetime objects.
- Why is it useful?
  - Dates are often stored as strings in CSV files, making it hard to perform operations like filtering by year or calculating durations.
  - parse_dates automatically converts these strings to datetime.

In [33]:
data = "Name,DOB\nAlice,1990-01-01\nBob,1995-05-15"

# Automatically parse the 'DOB' column as datetime
df = pd.read_csv(StringIO(data), parse_dates=['DOB'])
print(df)
print(df.dtypes)

    Name        DOB
0  Alice 1990-01-01
1    Bob 1995-05-15
Name            object
DOB     datetime64[ns]
dtype: object

**(xi) converters (Custom Transformations):**
- The converters parameter allows us to apply a custom function to transform the values in specific columns as they are read.

In [34]:
data = "Name,Salary\nAlice,$1000\nBob,$2000"

# Custom function to remove the dollar sign and convert to int
df = pd.read_csv(StringIO(data), converters={'Salary': lambda x: int(x.strip('$'))}) 
# The Salary column contains $ symbols, which are removed by the custom function. Also this column is converted to integers.
print(df)

    Name  Salary
0  Alice    1000
1    Bob    2000

**(xii) na_values (Handling Missing Values):**
- This parameter specifies additional values to treat as missing (NaN).
- Why is it useful?
  - In some files, missing data might be represented as special strings like NA, Unknown, or N/A. We can specify these strings with na_values so pandas correctly identify them as missing.

In [35]:
data = "Name,Age,City\nAlice,30,New York\nBob,NaN,Unknown"

# Treat 'Unknown' as a missing value
df = pd.read_csv(StringIO(data), na_values=['Unknown']) # The string Unknown is treated as NaN.
df

    Name   Age      City
0  Alice  30.0  New York
1    Bob   NaN       NaN

**(xiii) chunsize**
- Helps loading data in chunks.

In [5]:
data = "Name,Age,City\nAlice,30,New York\nBadLine\nBob,25,Los Angeles\nAlice,30,New York\nBadLine\nBob,25,Los Angeles\nAlice,30,New York\nBadLine\nBob,25,Los Angeles\nAlice,30,New York\nBadLine\nBob,25,Los Angeles\nAlice,30,New York\nBadLine\nBob,25,Los Angeles"

dfs = pd.read_csv(StringIO(data), chunksize=10);

# We can perform the task on each chunk:
for chunk in dfs:
    print(chunk.shape)
    print(chunk)

(10, 3)
      Name   Age         City
0    Alice  30.0     New York
1  BadLine   NaN          NaN
2      Bob  25.0  Los Angeles
3    Alice  30.0     New York
4  BadLine   NaN          NaN
5      Bob  25.0  Los Angeles
6    Alice  30.0     New York
7  BadLine   NaN          NaN
8      Bob  25.0  Los Angeles
9    Alice  30.0     New York
(5, 3)
       Name   Age         City
10  BadLine   NaN          NaN
11      Bob  25.0  Los Angeles
12    Alice  30.0     New York
13  BadLine   NaN          NaN
14      Bob  25.0  Los Angeles

**(v) squeeze (Convert to Series):**
- If our data contains only one column, setting squeeze=True will convert the DataFrame into a pandas Series.

In [4]:
data = "Name\nAlice\nBob"

# Reading as a single-column Series
df = pd.read_csv(StringIO(data), squeeze=True)
print(df)

TypeError: read_csv() got an unexpected keyword argument 'squeeze'

In [ ]:
# Summary:
Parameter                           Purpose  
sep	                   Specify how columns are separated (e.g., ;)  
index_col	           Set a specific column as the row index.  
header	               Define which row contains column headers.  
usecols	               Read only specific columns.
squeeze	               Convert single-column DataFrame to Series.  
skiprows	           Skip rows at the start of the file.  
nrows	               Limit the number of rows to read.  
encoding	           Specify file encoding (e.g., utf-8, latin-1).  
on_bad_lines	       Handle lines with errors (e.g., skip them).  
dtype	               Enforce specific data types for columns.  
parse_dates	           Convert date strings to datetime objects.  
converters	           Apply custom functions to transform column values.  
na_values	           Treat specific strings as missing (NaN).

================================================================================================================

### II) Reading Excel File (read_excel)

- Syntax: pandas.read_excel(io, sheet_name=0, header=0, usecols=None, nrows=None, ...)
  - Key Parameters:
    - io: File path or URL of the Excel file.
    - sheet_name: Excel file can have multiple sheets, sheet_name specifies the sheet to read (default is the first sheet).
    - header: Row number to use as the column names (default is the first row).
    - usecols: Columns to read (e.g., "A:C" or a list like [0, 2]).
    - nrows: Number of rows to read.

In [ ]:
# Example: To read a specific sheet, use the sheet_name parameter:
data = pd.read_excel("data.xlsx", sheet_name="Sheet2")

- Note: We can even use index_col parameter, it will work same as it did in read_csv().

In [ ]:
# Example: We can load specific columns by specifying usecols:
data = pd.read_excel("data.xlsx", usecols=["Name", "Age"])

In [ ]:
# Example: Use nrows to read a limited number of rows:
data = pd.read_excel("data.xlsx", nrows=2)

- If our Excel file has missing values, they are automatically handled as NaN.

In [ ]:
# Example: Reading Multiple Sheets:
sheets = pd.read_excel("data.xlsx", sheet_name=None)  # Returns a dictionary of DataFrames
print(sheets.keys())  # List all sheet names

In [ ]:
# Example: Skipping Rows:
data = pd.read_excel("data.xlsx", skiprows=1)  # Skip the first row

In [ ]:
# Example: Specifying Data Types:
data = pd.read_excel("data.xlsx", dtype={"Age": int})

- Common Errors and Fixes
  - FileNotFoundError: Ensure the file path is correct.
  - ValueError: Check the sheet name if it doesn’t exist.
  - Missing openpyxl: Install it using pip install openpyxl.

### III) Reading txt files

- Before loading text file we need to make sure what is the separator between the columns.

In [ ]:
# Example: Assuming the saparator is a tab:
pd.read_csv('que.txt', sep='\t')  # Here, we use read_csv() only

### IV) Importing Data from JSON (read_json):

- We will be using train.json dataset here.
- It is present on Kaggle website in Recipe Ingredients Dataset.
- This JSON is basicall a prediction of cuisnine based on the ingredients/

In [6]:
# Example: Importing from a file:
pd.read_json('train.json')

          id      cuisine                                        ingredients
0      10259        greek  [romaine lettuce, black olives, grape tomatoes...
1      25693  southern_us  [plain flour, ground pepper, salt, tomatoes, g...
2      20130     filipino  [eggs, pepper, salt, mayonaise, cooking oil, g...
3      22213       indian                [water, vegetable oil, wheat, salt]
4      13162       indian  [black pepper, shallots, cornflour, cayenne pe...
...      ...          ...                                                ...
39769  29109        irish  [light brown sugar, granulated sugar, butter, ...
39770  11462      italian  [KRAFT Zesty Italian Dressing, purple onion, b...
39771   2238        irish  [eggs, citrus fruit, raisins, sourdough starte...
39772  41882      chinese  [boneless chicken skinless thigh, minced garli...
39773   2362      mexican  [green chile, jalapeno chilies, onions, ground...

[39774 rows x 3 columns]

In [7]:
# Example: Importing from a URL:
pd.read_json('https://dummyjson.com/posts')

                                                posts  total  skip  limit
0   {'id': 1, 'title': 'His mother had always taug...    251     0     30
1   {'id': 2, 'title': 'He was an expert but not i...    251     0     30
2   {'id': 3, 'title': 'Dave watched as the forest...    251     0     30
3   {'id': 4, 'title': 'All he wanted was a candy ...    251     0     30
4   {'id': 5, 'title': 'Hopes and dreams were dash...    251     0     30
5   {'id': 6, 'title': 'Dave wasn't exactly sure h...    251     0     30
6   {'id': 7, 'title': 'This is important to remem...    251     0     30
7   {'id': 8, 'title': 'One can cook on and with a...    251     0     30
8   {'id': 9, 'title': 'There are different types ...    251     0     30
9   {'id': 10, 'title': 'They rushed out the door....    251     0     30
10  {'id': 11, 'title': 'It wasn't quite yet time ...    251     0     30
11  {'id': 12, 'title': 'She was aware that things...    251     0     30
12  {'id': 13, 'title': 'She wanted rainbow hair.'...    251     0     30
13  {'id': 14, 'title': 'The paper was blank.', 'b...    251     0     30
14  {'id': 15, 'title': 'The trees, therefore, mus...    251     0     30
15  {'id': 16, 'title': 'There was only one way to...    251     0     30
16  {'id': 17, 'title': 'She was in a hurry.', 'bo...    251     0     30
17  {'id': 18, 'title': 'She had a terrible habit ...    251     0     30
18  {'id': 19, 'title': 'The rain and wind abruptl...    251     0     30
19  {'id': 20, 'title': 'He couldn't remember exac...    251     0     30
20  {'id': 21, 'title': 'He wandered down the stai...    251     0     30
21  {'id': 22, 'title': 'She has seen this scene b...    251     0     30
22  {'id': 23, 'title': 'It's an unfortunate reali...    251     0     30
23  {'id': 24, 'title': 'The robot clicked disappr...    251     0     30
24  {'id': 25, 'title': 'It went through such rapi...    251     0     30
25  {'id': 26, 'title': 'She patiently waited for ...    251     0     30
26  {'id': 27, 'title': 'Ten more steps.', 'body':...    251     0     30
27  {'id': 28, 'title': 'He had three simple rules...    251     0     30
28  {'id': 29, 'title': 'The chair sat in the corn...    251     0     30
29  {'id': 30, 'title': 'Things aren't going well ...    251     0     30

### V) Importing Data from SQL:

- Go to Kaggle and download world.sql dataset from World-Cities, Pop, Lang, Rank (SQL create tbls).
- Go to workbench and create a database.
- Import the world.sql file in the database.
- Now once our data is stored in database, we are good to go.

- Note:
  - We must also have mysql.connector library installed as this library is used for communication between mysql and python. For that we can do: '!pip install mysql.connector' in Jupyter Notebook.
  - I was getting an error saying 'NotSupportedError: Authentication plugin 'caching_sha2_password' is not supported' then I went to CMD and did 'pip install --upgrade mysql-connector-python'.

In [3]:
import mysql.connector as mc
conn = mc.connect(host='localhost', user='root', password='root', database='world') # Establishing the connection. Here, we get the connection object
pd.read_sql_query('select * from city', conn)  # read_sql_query() function automatically creates the Pandas dataframe for city table.

C:\Users\abhin\AppData\Local\Temp\ipykernel_14272\3633213199.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query('select * from city', conn)  # read_sql_query() function automatically creates the Pandas dataframe for city table.

        ID            Name CountryCode       District  Population
0        1           Kabul         AFG          Kabol     1780000
1        2        Qandahar         AFG       Qandahar      237500
2        3           Herat         AFG          Herat      186800
3        4  Mazar-e-Sharif         AFG          Balkh      127800
4        5       Amsterdam         NLD  Noord-Holland      731200
...    ...             ...         ...            ...         ...
4074  4075      Khan Yunis         PSE     Khan Yunis      123175
4075  4076          Hebron         PSE         Hebron      119401
4076  4077        Jabaliya         PSE     North Gaza      113901
4077  4078          Nablus         PSE         Nablus      100231
4078  4079           Rafah         PSE          Rafah       92020

[4079 rows x 5 columns]

In [4]:
# Example: Filtering data where CountryCode = IND
import mysql.connector as mc
conn = mc.connect(host='localhost', user='root', password='root', database='world') # Establishing the connection. Here, we get the connection object
pd.read_sql_query('select * from city where CountryCode="IND"', conn)

C:\Users\abhin\AppData\Local\Temp\ipykernel_14272\2871101743.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query('select * from city where CountryCode="IND"', conn)  # read_sql_query() function automatically creates the Pandas dataframe for city table.

       ID                Name CountryCode        District  Population
0    1024     Mumbai (Bombay)         IND     Maharashtra    10500000
1    1025               Delhi         IND           Delhi     7206704
2    1026  Calcutta [Kolkata]         IND    West Bengali     4399819
3    1027    Chennai (Madras)         IND      Tamil Nadu     3841396
4    1028           Hyderabad         IND  Andhra Pradesh     2964638
..    ...                 ...         ...             ...         ...
336  1360        Ambala Sadar         IND         Haryana       90712
337  1361          Baidyabati         IND    West Bengali       90601
338  1362               Morvi         IND         Gujarat       90357
339  1363             Raigarh         IND     Chhatisgarh       89166
340  1364            Vejalpur         IND         Gujarat       89053

[341 rows x 5 columns]

- Here, we have other parameters also like chunksize (which we use to load large data in chunks).

### VI) Exporting to